{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "WhisperForConditionalGeneration",
    "parent_library": "transformers.models.whisper.modeling_whisper"
  },
  "base_model_name_or_path": "openai/whisper-large-v3",
  "bias": "none",
  "corda_config": null,
  "eva_config": {
    "eva_gamma": 0.95,
    "num_singular_values": 64,
    "rho": 0.8
  },
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "eva",
  "layer_replication": null,
  "layers_pattern": "encoder.layers",
  "layers_to_transform": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7
  ],
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "fc2",
    "o_proj",
    "v_proj",
    "fc1",
    "encoder.embed_positions",
    "k_proj",
    "q_proj"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": true
}